recept/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыРезервы</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Покупатели</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходнойКонтроль</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Производство</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НДССтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/AccumulationRegisters/ОстаткиМатериалов/ОстаткиМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериалов</name>
  <resources>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ВыпускПродукции</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/AccumulationRegisters/ЗаказыРезервы/ЗаказыРезервы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыРезервы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристики</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/Documents/ЗаказКлиента/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Если идет загрузка данных (обмен, РИБ), то никакую логику не выполняем
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Пересчитываем сумму только при обычной записи/проведении пользователем или кодом
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
   
	// 1. Подготавливаем движения
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.ЗаказыРезервы.Записывать = Истина;
    
    // 2. Подготовка данных: выгружаем ТЧ в таблицу для запроса
    ТаблицаТоваров = Товары.Выгрузить();
    
    // 3. Блокировка данных для предотвращения параллельного списания
    Блокировка = Новый БлокировкаДанных;
    ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиМатериалов");
    ЭлементБлокировки.ИсточникДанных = ТаблицаТоваров;
    ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Наименование", "Номенклатура");
    ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристики", "Характеристика");
    ЭлементБлокировки.УстановитьЗначение("Счет", Документы.ЗаказКлиента.ПустаяСсылка());
    ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
    Блокировка.Заблокировать();
    
    // 4. Очищаем старые движения (если документ перепроводится)
    Движения.ОстаткиМатериалов.Очистить();
    Движения.ЗаказыРезервы.Очистить();
    
    // Физически удаляем старые записи из регистров
    Движения.ОстаткиМатериалов.Записать();
    Движения.ЗаказыРезервы.Записать();
    
    // 5. ЕДИНЫЙ ЗАПРОС (ВТ + Остатки)
    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	ТчТовары.Номенклатура КАК Номенклатура,
        |	ТчТовары.Характеристика КАК Характеристика,
        |	ТчТовары.Количество КАК КоличествоНужно,
        |	ТчТовары.Производство КАК Производство,
        |	ТчТовары.НомерСтроки КАК НомерСтрокиТч
        |ПОМЕСТИТЬ ВТ_Нужды
        |ИЗ
        |	&ТаблицаТоваров КАК ТчТовары
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
		|	ВТ.Номенклатура КАК Номенклатура,
    	|	ВТ.Характеристика КАК Характеристика,
    	|	ВТ.КоличествоНужно КАК КоличествоНужно,
    	|	ВТ.Производство КАК Производство,
    	|	ВТ.НомерСтрокиТч КАК НомерСтрокиТч,
    	|	// Партия теперь НЕОПРЕДЕЛЕНО, как мы договаривались ранее
    	|	ЕСТЬNULL(Остатки.Партия, НЕОПРЕДЕЛЕНО) КАК Партия,
    	|	ЕСТЬNULL(Остатки.ОстатокОстаток, 0) КАК СвободныйОстаток
        |ИЗ
        |	ВТ_Нужды КАК ВТ
        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиМатериалов.Остатки(
        |				&Период,
        |				(Наименование, Характеристики) В
        |						(ВЫБРАТЬ
        |							ВТ_Нужды.Номенклатура,
        |							ВТ_Нужды.Характеристика
        |						ИЗ
        |							ВТ_Нужды
        |						ГДЕ
    	|							ВТ_Нужды.Производство = ЛОЖЬ) // Читаем остатки только для резервов
    	|					И Счет = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК Остатки
    	|		ПО ВТ.Номенклатура = Остатки.Наименование
    	|			И ВТ.Характеристика = Остатки.Характеристики
        |ИТОГИ
        |	МАКСИМУМ(КоличествоНужно),
        |	СУММА(СвободныйОстаток),
        |	МАКСИМУМ(Номенклатура),
        |	МАКСИМУМ(Характеристика),
        |	МАКСИМУМ(Производство)
        |ПО
        |	НомерСтрокиТч"; // Группируем по строке ТЧ, чтобы обработать каждую позицию отдельно

    Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
    Запрос.УстановитьПараметр("Период",         Новый Граница(МоментВремени(), ВидГраницы.Исключая));

    РезультатЗапроса = Запрос.Выполнить();
  
    // 4. ОБХОД РЕЗУЛЬТАТОВ (Иерархия: Строка ТЧ -> Партии)
    ВыборкаСтрока = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    
    Пока ВыборкаСтрока.Следующий() Цикл
        
        НужноеКоличество = ВыборкаСтрока.КоличествоНужно;
        
        // 5. Проверка остатков на складе для варианта "РЕЗЕРВ"
		Если ВыборкаСтрока.Производство Тогда
			
           
	        // -----------------------------------------------------
	        // СЦЕНАРИЙ А: ПРОИЗВОДСТВО (Остатки не проверяем)
	        // -----------------------------------------------------
	        ДвЗаказы = Движения.ЗаказыРезервы.ДобавитьПриход();
	        ДвЗаказы.Период          = Дата;
	        ДвЗаказы.Счет            = Ссылка;
	        ДвЗаказы.ДатаОтгрузки	 = ДатаОтгрузки;
	        ДвЗаказы.Номенклатура    = ВыборкаСтрока.Номенклатура;
	        ДвЗаказы.Характеристики  = ВыборкаСтрока.Характеристика;
	        ДвЗаказы.Количество      = НужноеКоличество;

	    Иначе
	            
	        // -----------------------------------------------------
	        // СЦЕНАРИЙ Б: РЕЗЕРВ СО СКЛАДА (Проверяем остатки)
	        // -----------------------------------------------------
	        СвободныйОстатокОбщий = ВыборкаСтрока.СвободныйОстаток;
	            
	        // 1. Защита от "фантомных" нехваток (если кто-то забрал товар до нас)
	        Если НужноеКоличество > СвободныйОстатокОбщий Тогда
	                
	            Отказ = Истина;
	                
	            Сообщение = Новый СообщениеПользователю;
	            Дефицит = НужноеКоличество - СвободныйОстатокОбщий;
	            Сообщение.Текст = СтрШаблон(
	                "Строка %1: Недостаточно товара '%2'. Требуется в резерв: %3, Свободно на складе: %4. Не хватает: %5",
	                ВыборкаСтрока.НомерСтрокиТч,
	                ВыборкаСтрока.Номенклатура,
	                НужноеКоличество,
	                СвободныйОстатокОбщий,
	                Дефицит
	            );
	            Сообщение.Поле = СтрШаблон("Товары[%1].Количество", ВыборкаСтрока.НомерСтрокиТч - 1);
	            Сообщение.УстановитьДанные(ЭтотОбъект);
	            Сообщение.Сообщить();
	                
	            Продолжить; 
	        КонецЕсли;
	            
	        // 2. Распределение резерва по партиям (FIFO или случайный порядок регистра)
	        ОсталосьРаспределить = НужноеКоличество;
	            
	        ВыборкаПартия = ВыборкаСтрока.Выбрать();
	        Пока ВыборкаПартия.Следующий() И ОсталосьРаспределить > 0 Цикл
	                
	            Если ВыборкаПартия.СвободныйОстаток <= 0 Тогда Продолжить; КонецЕсли;
	                
	            БеремИзПартии = Мин(ОсталосьРаспределить, ВыборкаПартия.СвободныйОстаток);
	                
	            // Списываем из свободного остатка
	            ДвРасход = Движения.ОстаткиМатериалов.ДобавитьРасход();
	            ДвРасход.Период          = Дата;
	            ДвРасход.Наименование    = ВыборкаПартия.Номенклатура;
	            ДвРасход.Характеристики  = ВыборкаПартия.Характеристика;
	            ДвРасход.Счет            = Документы.ЗаказКлиента.ПустаяСсылка();
	            ДвРасход.Партия          = ВыборкаПартия.Партия;
	            ДвРасход.Остаток         = БеремИзПартии;
	                
	            // Зачисляем в резерв под конкретный заказ
	            ДвПриход = Движения.ОстаткиМатериалов.ДобавитьПриход();
	            ДвПриход.Период          = Дата;
	            ДвПриход.Наименование    = ВыборкаПартия.Номенклатура;
	            ДвПриход.Характеристики  = ВыборкаПартия.Характеристика;
	            ДвПриход.Счет            = Ссылка; // Наш Заказ Клиента
	            ДвПриход.Партия          = ВыборкаПартия.Партия;
	            ДвПриход.Остаток         = БеремИзПартии;
	                
	            ОсталосьРаспределить     = ОсталосьРаспределить - БеремИзПартии;
	                
	        КонецЦикла;
	            
	    КонецЕсли;
        
    КонецЦикла;

КонецПроцедуры
